{
    "infos": {
        "title": "Sword of Destruction",
        "class": "Warrior",
        "position": "Front-600",
        "attack range": "7800",
        "damage type": "Magical",
        "gender": "Male",
        "age": "30",
        "height": "194",
        "race": "Human",
        "constellation": "Hexipolia the Wanderer",
        "birth of month": "December 30th, Month of Patience",
        "like": "Landscape back at home, leisurely reading, alone time, and Queen Artemia",
        "dislike": "Weaker self in the past, Targarios.",
        "story": "Born in a noble family in Penteonia, Bernheim von Lachelima was gifted with outstanding martial skills. He had the strength of a giant and excellent judgment, so it was undeniable that he would make a great knight. However, he had a fatal flaw that kept him from being successful in Penteonia: He could not use the power of light at all. No matter how hard he tried how strong his faith and will were, the power of light did not answer to his calling. Although all he ever wanted was to serve his nation and the Queen, the fact that his incapability was keeping him from being more than a low-level knight frustrated him. Bernheim did not give up and trained hard to handle the power of light, bus his constant lack of progress slowly started to weaken his mind. One day, he visited the Central Church to study the power of light and it's mechanism. It was when he was quietly reading a book that he heard a sound. It was an angelic voice calling for him.",
        "thumbnail": "./data/kr/assets/heroes/Bernheim/ico.png",
        "story_": "Born in a noble family in Penteonia, Bernheim von Lachelima was gifted with outstanding martial skills. He had the strength of a giant and excellent judgment, so it was undeniable that he would make a great knight. However, he had a fatal flaw that kept him from being successful in Penteonia: He could not use the power of light at all. No matter how hard he tried, how strong his faith and will were, the power of light did not answer to his calling. Although all he ever wanted was to serve his nation and the Queen, the fact that his incapability was keeping him from being more than a low-level knight frustrated him. Bernheim did not give up and trained hard to handle the power of light, but his constant lack of progress slowly started to weaken his mind. One day, he visited the Central Church to study the power of light and its mechanism. It was when he was quietly reading a book that he heard a sound. It was an angelic voice calling for him. The long-accumulated frustration of Bernheim led him to where the voice was coming from, a room sealed with multiple magic barriers in the basement of the church. As he moved closer to it, the barriers vanished as if they were never there. What he saw inside the room was a sword in the shape of an angel, exuding blinding light. 'You are the chosen one', said the sword, drawing him near with holy light. Thinking that his relentless effort had finally paid off, he slowly grasped the sword. Then, his mind was drawn into the deepest darkness. The darkness that captured him—it was the endless shadowy void of futility. A vessel that could never be filled; a whole other universe. In the vast darkness, Bernheim felt his mind deteriorating and his existence fading away. His mind and body was slowly being encroached by a dark, ominous power. However, Bernheim was also one of the Penteonian Knights, a Knight of Light who swore not to be defeated by darkness. He rose from the shrouding darkness, regaining consciousness with his indomitable spirit. When he came to his senses, lying on the floor, there was a giant black sword in his hand. The demonic sword with the appearance of a demon was laughing and mocking the knight who broke away from the path of light. Eventually, Bernheim was banished from Penteonia, and he started to live a new life as a mercenary in Vespia Empire with that malicious, foul-mouthed demonic sword in his hand..."
    },
    "skills": {
        "1": {
            "name": "Circle of Futility",
            "cost": null,
            "cooldown": "15",
            "description": "Attacks the target and nearby enemies within range, dealing ??? M.DMG and placing the Circle of Futility. Circle of Futility deals ??? M.DMG, reduces ATK Spd by 300, and prevents enemies from receiving positive effects over 4 sec. A 4 -sec Cooldown will be applied at the beginning of the first battle.",
            "thumbnail": "./data/kr/assets/heroes/Bernheim/skills/1.png"
        },
        "2": {
            "name": "Battle Initiation",
            "cost": null,
            "cooldown": "22",
            "description": "Attacks enemies within frontal range, dealing ??? M.DMG and knocking them back. Then, increases own All Block by ??? and DEF by ???, and gains immunity to CC for 15 sec. 8 sec Cooldown will be applied at the beginning of the first battle.",
            "thumbnail": "./data/kr/assets/heroes/Bernheim/skills/2.png"
        },
        "3": {
            "name": "Destroyer",
            "cost": null,
            "cooldown": "22",
            "description": "Deals ??? M.DMG over 10 attacks to nearby enemies in a circular range around self. Then, attacks enemies in a wide surrounding area, dealing ??? M.DMG and stunning them for 5 sec. If the target is not a Hero, each attack will deal additional ??? M.DMG. A 10 -sec Cooldown will be applied at the beginning of the first battle.",
            "thumbnail": "./data/kr/assets/heroes/Bernheim/skills/3.png"
        },
        "4": {
            "name": "Breakdown",
            "cost": null,
            "cooldown": null,
            "description": "Bernheim cannot recover Mana, and all his Skills do not consume any Mana. Normal and Skill attacks inflict Breakdown to enemies for 10 sec, reducing their Heal Rate by 1%, and increasing own ATK and Heal Rate by ??? and 0.5% respectively. All effects stack up to 50 times.",
            "thumbnail": "./data/kr/assets/heroes/Bernheim/skills/4.png"
        }
    },
    "books": {
        "1": {
            "II": "DMG is increased by 10%.",
            "III": "DMG is increased by 15%.",
            "IV": "DMG is increased by 25%."
        },
        "2": {
            "II": "DEF Boost is increased by 10%.",
            "III": "DEF Boost is increased by 15%.",
            "IV": "DEF Boost is increased by 25%."
        },
        "3": {
            "II": "DMG is increased by 10%.",
            "III": "DMG is increased by 15%.",
            "IV": "DMG is increased by 25%."
        },
        "4": {
            "II": "ATK Boost is increased by 10%.",
            "III": "ATK Boost is increased by 15%.",
            "IV": "ATK Boost is increased by 25%."
        }
    },
    "perks": {
        "t3": {
            "1": {
                "light": {
                    "effect": "Increases M.DMG the enemies on the [Circle of Futility] take by 25%.",
                    "thumbnail": "./data/kr/assets/heroes/Bernheim/perks/s1l.png"
                },
                "dark": {
                    "effect": "The duration of [Circle of Futility] increases by 4 sec if cast while under [Battle Initiation].",
                    "thumbnail": "./data/kr/assets/heroes/Bernheim/perks/s1d.png"
                }
            },
            "2": {
                "light": {
                    "effect": "Dispels all negative effects from self upon casting.",
                    "thumbnail": "./data/kr/assets/heroes/Bernheim/perks/s2l.png"
                },
                "dark": {
                    "effect": "Increases Heal Rate by 30% for the duration of the effect.",
                    "thumbnail": "./data/kr/assets/heroes/Bernheim/perks/s2d.png"
                }
            },
            "3": {
                "light": {
                    "effect": "Ignores Enemy's Block.",
                    "thumbnail": "./data/kr/assets/heroes/Bernheim/perks/s3l.png"
                },
                "dark": {
                    "effect": "Additional DMG is against Non-Hero enemies now ignores DEF.",
                    "thumbnail": "./data/kr/assets/heroes/Bernheim/perks/s3d.png"
                }
            },
            "4": {
                "light": {
                    "effect": "Breakdown stacks become irremovable.",
                    "thumbnail": "./data/kr/assets/heroes/Bernheim/perks/s4l.png"
                },
                "dark": {
                    "effect": "ATK and Heal Rate Boost become irremovable.",
                    "thumbnail": "./data/kr/assets/heroes/Bernheim/perks/s4d.png"
                }
            }
        },
        "t5": {
            "light": {
                "effect": "ATK, DEF, HP +15% / Crit Chance +100",
                "thumbnail": "./data/kr/assets/heroes/Bernheim/perks/light.png"
            },
            "dark": {
                "effect": "At the beginning of the first battle, reduces the Cooldown of own Skills by 5 sec. When this effect is activated during Guild War, the effect is doubled.",
                "thumbnail": "./data/kr/assets/heroes/Bernheim/perks/dark.png"
            }
        }
    },
    "uw": {
        "name": "Kiln of Futility, Targarios",
        "description": "Every 10 sec, increases own ATK by (0) all DEF by (1) and reduces Cooldown of all Skills by (2) sec. While under [Battle Initiation], Cooldown Reduction will be doubled. ATK and DEF Boost are irremovable and stack up to 4 times.",
        "value": {
            "0": {
                "0": "10%",
                "1": "12%",
                "2": "14%",
                "3": "17%",
                "4": "21%",
                "5": "25%"
            },
            "1": {
                "0": "10%",
                "1": "12%",
                "2": "14%",
                "3": "17%",
                "4": "21%",
                "5": "25%"
            },
            "2": {
                "0": "1",
                "1": "1.2",
                "2": "1.4",
                "3": "1.7",
                "4": "2.1",
                "5": "2.5"
            }
        },
        "thumbnail": "./data/kr/assets/heroes/Bernheim/uw.png",
        "story": "The name of this demonic sword means 'the one who cannot be satiated' and 'the one with ceaseless craving.' It has the power to absorb all forms of energy, evil or holy, to use them as its own. It has its own will, and a character that is very temperamental, scatterbrained, and cruel. Even Queen Artemia does not know the exact reason why this demonic sword was sealed under the Central Church in Penteonia, but rumor says that Targarios was a Dark Lord in the distant past. Considering its frivolous character, that might seem unlikely. However, there is no doubt that it has devastating powers."
    },
    "uts": {
        "1": {
            "name": "Faded Sword",
            "description": "[Circle of Futility] Reduces the hit targets' Mana by (0) and increases M.DMG they take by 25% for 5 sec.",
            "value": {
                "0": {
                    "0": "100",
                    "1": "120",
                    "2": "140",
                    "3": "170",
                    "4": "210",
                    "5": "250"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Bernheim/ut/1.png",
            "story": "A standard issue sword of Penteonian Knights that Bernheim used before he fell for Targarios's trap. It is designed to draw out great power when imbued with the power of light. However, one day, Targarios noticed that Bernheim was trying to use other weapons instead of it. Targarios went mad and broke all the other weapons after absorbing all the powers, protections, and blessings they bore. Bernheim saw it, let out a big sigh, and threw broken metal pieces away, but he decided to carry this sword with him."
        },
        "2": {
            "name": "Medal of Light",
            "description": "[Battle Initiation] Consumes (0) of current HP upon use, but the effect will become irremovable.",
            "value": {
                "0": {
                    "0": "50%",
                    "1": "46%",
                    "2": "41%",
                    "3": "35%",
                    "4": "28%",
                    "5": "20%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Bernheim/ut/2.png",
            "story": "A medal of light bestowed upon him when he was conferred knighthood in Penteonia. Having the sun engraved on it, this gold medal assures the bearer that the light is always with him. Although Bernheim was deprived of his knighthood and was banished from the country, his loyalty always lies with the proud Penteonian Knights."
        },
        "3": {
            "name": "Mercenary's Goblet",
            "description": "[Destroyer] Increases DMG by (0) and each hit has a 20% chance to stun the enemy for 0.5 sec.",
            "value": {
                "0": {
                    "0": "20%",
                    "1": "24%",
                    "2": "29%",
                    "3": "35%",
                    "4": "42%",
                    "5": "50%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Bernheim/ut/3.png",
            "story": "A commemorative goblet only given to mighty and brave mercenaries in the Empire. The wolf, the symbol of Empire, is engraved on it. In recognition of the countless victories Bernheim earned for the Empire, the royal family gave him this exquisite goblet, one of only 5 in the world. Rumor has it that the goblet has a spell that makes any drink poured into it restore stamina."
        },
        "4": {
            "name": "Unsent Letter",
            "description": "[Breakdown] Normal and Skill attacks now inflict 2 stacks on the enemy and self. The max number of stacks increases by (0).",
            "value": {
                "0": {
                    "0": "20",
                    "1": "24",
                    "2": "29",
                    "3": "35",
                    "4": "42",
                    "5": "50"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Bernheim/ut/4.png",
            "story": "Letters that Bernheim wrote to his family after his banishment. He still has not decided whether or not to send them until now, after 7 years have passed from his banishment. The letters are mainly addressed to his brother and sister who were 5 and 10 years younger than him when he was banished."
        }
    },
    "sw": {
        "requirement": "Charges up upon dealing DMG 70 times.",
        "description": "Summons the soul of Kiln of Futility, Targarios, attacking all enemies every sec for 10 sec, dealing ??? M.DMG. Whenever dealing DMG on the enemy, absorbs its power to increase DMG dealt to enemies by 2% for 10 sec. This effect stacks up to 15 times.",
        "cooldown": "22",
        "uses": "6",
        "thumbnail": "./data/kr/assets/heroes/Bernheim/sw.png",
        "advancement": {
            "1": "Stuns the tartget for 1 sec.",
            "2": "Max stacks for the effect is changed to 30."
        },
        "story": "In the past, there was a dark lord who became consumed by endless voracity and thirst.\nHe proceeded to become an embodiment of catastrophe who consumed everything in his path like a plague, and became known as the 'Kiln of Futility'.\n\nTo stop this voracious dark lord from ravaging the world, the young prince of Penteonia depserately challanged the dark lord, and defeated him. The dark lord was then sealed inside the sword name Targarios and was moved to the central church of Penteonia. Even in his sealed state, Targarios searched presistently for an innocent lamb who would free him from the seal. He continuously whispered his voice of temptation, and finally, his wish was fulfilled when Bernheim took Targarios into his hands. Though he had an atrocious past behind him, the former dark lord became an entity with an extremely bizarre personality, and he managed to sense the darkness residing deep within Bernheim, who sort of gave him Freedom.\n\nTargarios, upon examining Bernheim's inner shadow of consciousness which Bernheim himself is unaware of, decided that he will get along nicely with Bernheim, a rather poor human struggling to reach for the light. Even though his body is sealed inside the sword, Targarios will proudly show its power as the dark lord of futility, whenever Bernheim wishes for strength."
    },
    "splashart": "./data/kr/assets/heroes/Bernheim/sa.png",
    "costumes": "./data/kr/assets/heroes/Bernheim/cos",
    "visual": null,
    "aliases": null
}