{
    "infos": {
        "title": "Sage of the Lake",
        "class": "Wizard",
        "position": "Back-500",
        "attack range": "7500",
        "damage type": "Magical",
        "gender": "Male",
        "age": "53",
        "height": "242",
        "race": "Lizardman",
        "constellation": "Satua the Sage",
        "birth of month": "February 7th, Month of Wisdom",
        "like": "His tribe, leisurely reading, fish and seafood dishes",
        "dislike": "Freedom oppressor, disputer, and violence",
        "story": "As the Empire expanded it's territory, the long occupying natives resisted relentlessly. However, the all eventually fell before the Empire's brutal military force as well as overwhelming technology. Dakaris' homeland, the reclusive Lake Eretana, hidden deep inside the mountains, was no exception. The Empire let the natives stay in their land, but by no means were they treated respect. To make things worse, the officers and nobles appointed to the area were mostly corrupted, making it even more difficult for the natives. The noble appointed to Lake Eretana was especially the worse. The atrocities grew worse each day, eventually leading to the deaths of young, and innocent Lizardmen. This lead to Dakaris to gather his tribe to get back their freedom.",
        "thumbnail": "./data/kr/assets/heroes/Dakaris/ico.png",
        "story_": "As the Empire expanded its territory, the long occupying natives resisted relentlessly. However, they all eventually fell before the Empire's brutal military force as well as overwhelming technology. Dakaris' homeland, the reclusive Lake Eretana, hidden deep inside the mountains, was no exception. The Empire let the natives stay in their land, but by no means were they treated with respect. To make things worse, the officers and nobles appointed to the area were mostly corrupted, making it even more difficult for the natives. The noble appointed to Lake Eretana was especially the worse. The atrocities grew worse each day, eventually leading to the deaths of young, and innocent Lizardmen. This lead Dakaris to gather his tribe to get back their freedom. 'To soothe the spirits of my ancestors, and to liberate my tribe - I will not hesitate, I will take back our rightful future with the Resistance.' Currently, he is a key member of the Resistance, leading them with his wisdom and insight."
    },
    "skills": {
        "1": {
            "name": "Judgment Upon Them!",
            "cost": "2",
            "cooldown": "3",
            "description": "Deals ??? M. DMG to the target and enemies nearby, stunning them for 1 sec and healing allies within the range by ??? HP. Activating [Will of Resistance] that lasts for 3 sec upon self. [Will of Resistance] can be stacked up to max 2 times, and each stack increases DMG dealt by this Skill by 25%. Activating [Grant Me Strength!] will reset Cooldown of this Skill and remove Cooldown up to 3 Skill uses.",
            "thumbnail": "./data/kr/assets/heroes/Dakaris/skills/1.png"
        },
        "2": {
            "name": "Grant Me Strength!",
            "cost": "No Cost",
            "cooldown": "15",
            "description": "Over 10 sec, heals own HP by ??? and recovers ??? orbs of Mana, increasing ATK by ??? for the duration. If own HP is full upon activation, casts a shield that blocks ??? DMG and grants CC Immunity for 5 sec. If there are 3 or less allies, this effect will apply to all allies.",
            "thumbnail": "./data/kr/assets/heroes/Dakaris/skills/2.png"
        },
        "3": {
            "name": "May Their Agony End!",
            "cost": "3",
            "cooldown": "13",
            "description": "Attacks a random enemy 5 times, dealing ??? M.DMG in total. If the target is not a Hero, deals additional ??? M.DMG. While [Grant Me Strength!] is active, an enemy with highest ATK will be prioritized.",
            "thumbnail": "./data/kr/assets/heroes/Dakaris/skills/3.png"
        },
        "4": {
            "name": "Might of the Ancestors!",
            "cost": null,
            "cooldown": null,
            "description": "If own HP is full, increases ATK by ???. If not, heals own HP by ??? every sec. Upon taking a fatal damage, consumes entire Mana to cast a shield that blocks ??? DMG and grants CC Immunity for 5 sec. While the shield is active, Dakaris cannot recover Mana.",
            "thumbnail": "./data/kr/assets/heroes/Dakaris/skills/4.png"
        }
    },
    "books": {
        "1": {
            "II": "DMG is increased by 10%.",
            "III": "DMG is increased by 15%.",
            "IV": "DMG is increased by 25%."
        },
        "2": {
            "II": "ATK Boost is increased by 10%.",
            "III": "ATK Boost is increased by 15%.",
            "IV": "ATK Boost is increased by 25%."
        },
        "3": {
            "II": "DMG is increased by 10%.",
            "III": "DMG is increased by 15%.",
            "IV": "DMG is increased by 25%."
        },
        "4": {
            "II": "ATK Boost is increased by 10%.",
            "III": "ATK Boost is increased by 15%.",
            "IV": "ATK Boost is increased by 25%."
        }
    },
    "perks": {
        "t3": {
            "1": {
                "light": {
                    "effect": "Increases Stun duration by 1 sec.",
                    "thumbnail": "./data/kr/assets/heroes/Dakaris/perks/s1l.png"
                },
                "dark": {
                    "effect": "Reduces Mana Cost by 1.",
                    "thumbnail": "./data/kr/assets/heroes/Dakaris/perks/s1d.png"
                }
            },
            "2": {
                "light": {
                    "effect": "Upon activation, increases own ATK Spd by 500.",
                    "thumbnail": "./data/kr/assets/heroes/Dakaris/perks/s2l.png"
                },
                "dark": {
                    "effect": "Increases duration of the shield by 5 sec.",
                    "thumbnail": "./data/kr/assets/heroes/Dakaris/perks/s2d.png"
                }
            },
            "3": {
                "light": {
                    "effect": "Gains CC Immunity for the duration of Skill.",
                    "thumbnail": "./data/kr/assets/heroes/Dakaris/perks/s3l.png"
                },
                "dark": {
                    "effect": "Increases DMG by 40%.",
                    "thumbnail": "./data/kr/assets/heroes/Dakaris/perks/s3d.png"
                }
            },
            "4": {
                "light": {
                    "effect": "Heal Rate is increased by 100%.",
                    "thumbnail": "./data/kr/assets/heroes/Dakaris/perks/s4l.png"
                },
                "dark": {
                    "effect": "If own HP is full, recovers 300 Mana every sec.",
                    "thumbnail": "./data/kr/assets/heroes/Dakaris/perks/s4d.png"
                }
            }
        },
        "t5": {
            "light": {
                "effect": "ATK, DEF, HP+15% / Crit Chance +100",
                "thumbnail": "./data/kr/assets/heroes/Dakaris/perks/light.png"
            },
            "dark": {
                "effect": "At the beginning of the first battle, gains [Ancestral Advice] that increases own CC Resist by 200 for 5 sec. If [Ancestral Advice] is still active after 5 sec, dispels negative effects from 3 random allies, and increases their DEF by 50% for 10 sec. DEF Boost is irremovable.",
                "thumbnail": "./data/kr/assets/heroes/Dakaris/perks/dark.png"
            }
        }
    },
    "uw": {
        "name": "Lake of Remembrance, Armekith",
        "description": "Dakaris takes (0) reduces DMG, and increases CC Resist by (1). After using a Skill, the effects are doubled for 2 sec.",
        "value": {
            "0": {
                "0": "10%",
                "1": "12%",
                "2": "14%",
                "3": "17%",
                "4": "21%",
                "5": "25%"
            },
            "1": {
                "0": "100",
                "1": "120",
                "2": "140",
                "3": "170",
                "4": "210",
                "5": "250"
            }
        },
        "thumbnail": "./data/kr/assets/heroes/Dakaris/uw.png",
        "story": "A treasure of the tribe that was hidden deep inside Lake Eretana. It contains hundreds of years of Lizardmen wisdom and magic. Its power is normally calm like still water, but this magical item can unleash devastating tsunami-like power if a user wishes to."
    },
    "uts": {
        "1": {
            "name": "Lakeside Banquet",
            "description": "[Judgment Upon Them!] Increases DMG by 50% and heals additional HP equal to (0) of the healed ally's Max HP.",
            "value": {
                "0": {
                    "0": "1%",
                    "1": "1.2%",
                    "2": "1.4%",
                    "3": "1.7%",
                    "4": "2.1%",
                    "5": "2.5%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Dakaris/ut/1.png",
            "story": "Dakaris' favorite and signature dish. It is one of the dishes that represent his tribe. It is a dish made with crawfish, clams, and many sides. He normally eats fish, but dines on this on special occasions."
        },
        "2": {
            "name": "Traditional Bracelet",
            "description": "[Grant Me Strength!] Decreases Cooldown by 5 sec, and increases Heal Rate & Mana Recovery by (0).",
            "value": {
                "0": {
                    "0": "20%",
                    "1": "24%",
                    "2": "29%",
                    "3": "35%",
                    "4": "42%",
                    "5": "50%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Dakaris/ut/2.png",
            "story": "A trinket Dakaris received from his parents. This bracelet is made with intertwined gold and silver bracelets. It is a traditional wedding bracelet that symbolizes everlasting bond. Dakaris has this bracelet as a memento of his parents."
        },
        "3": {
            "name": "Dagger of Sorcery",
            "description": "[May Their Agony End!] Increases DMG by (0). If this Skill kills an enemy, it will cast once more.",
            "value": {
                "0": {
                    "0": "20%",
                    "1": "24%",
                    "2": "29%",
                    "3": "35%",
                    "4": "42%",
                    "5": "50%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Dakaris/ut/3.png",
            "story": "A ceremonial dagger used by the Lizardmen of Lake Eretana. It was used as a decoration, especially in festivals and coming of age ceremonies. However, after the Empire's invasion, it got customized as a weapon by imbuing it with magic."
        },
        "4": {
            "name": "Tome of the Dragon",
            "description": "[Might of the Ancestors!] Increases shield amount by (0) and applies shield to all allies.",
            "value": {
                "0": {
                    "0": "20%",
                    "1": "24%",
                    "2": "29%",
                    "3": "35%",
                    "4": "42%",
                    "5": "50%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Dakaris/ut/4.png",
            "story": "A spellbook passed down from generation to generation. This is renowned as a history book passed down to the next sage of the tribe. It holds history of war, footsteps of great individuals, everyday life of the tribe, and many more. It has mystical power to bring those records out into reality for a little while via magic."
        }
    },
    "sw": {
        "requirement": "Charges up upon using Skills 7 times.",
        "description": "Remembrance, Armekith, creating a tidal wave, dealing ??? M.DMG to enemies within wide frontal range of self and knocking them down for 3 sec. Dakaris then heals ??? HP and 1 orbs of Mana to allies within range. Afterward, absorbs the soul of Lake of Remembrance, Armekith, increasing own ATK by 60% for 10 sec.",
        "cooldown": "20",
        "uses": "6",
        "thumbnail": "./data/kr/assets/heroes/Dakaris/sw.png",
        "advancement": {
            "1": "Dispels positive effects of enemies and negative effects of allies within range.",
            "2": "Reduces Skill Activation requirements to 5 times, and for the duration of Skill, the number of targets of [May Their Agony End!] inreases to 2."
        },
        "story": "For a long time, Eretana's Lizardman have performed a rite for the sacred entity of the lake every year.\nAltough that entity had never shown itself to others, it remembered the history, tradition, and academic knowledge of which the Lizardman researched, and helped them prosper.\nHowever, the lake became rapidly desolated following the Empire's violent invasion and brutality, and all the legacy of the Lizardman, including their tradition and culture, were destroyed. To retrieve the land which the empire took by force, Dakaris decided to summon the ancient entity of the lake. Dakaris successfully managed to summon the sacred beast by placing all the mana he had into Armekith, the relic of his Lizardman ancestors.\nAfter hearing what the Lizardman were going through as well as the reason why the lake was desolated, the sacred beast gladly offered its aid to Dakaris, and promised him that it will fulfill the will of the Lizardman gathered within Eretana lake since the beginning of time."
    },
    "splashart": "./data/kr/assets/heroes/Dakaris/sa.png",
    "costumes": "./data/kr/assets/heroes/Dakaris/cos",
    "visual": null,
    "aliases": null
}