{
    "infos": {
        "title": "Lovely Evil Spirit",
        "class": "Priest",
        "position": "Back-100",
        "attack range": "5400",
        "damage type": "Magical",
        "gender": "Female",
        "age": "???",
        "height": "131",
        "race": "Ghost",
        "constellation": "Graham the Thief",
        "birth of month": "May 30th, Month of Hope",
        "like": "People who could be friends with her, animals and lively villages",
        "dislike": "Scary people, malice, being viewed as a monster",
        "story": "A very unconventional ghost. Those who see her may think of her as a ghost of an ordinary girl, but she's not a single spectral entity. Rather, she's an amalgamation of countless souls. Filled with tremendous spectral energy, she is powerful enough to make souls tremble and cast curses at her will. ....That is, if she was an ordinary ghost. Although she's a ghost born from an amalgamation of young souls that died in the Demon war 100 years ago, the souls of children are too pure and innocent to bear any grudge. Lavril, having been born with them, came into being with a pure and kind mind. Nonetheless, she's still a ghost. Her nature won't change. Even though she's currently a kind and poor girl, a child is like a piece of blank paper, in which a single drop of ink can easily change its color. Without any proper guidance, she can be a threat.",
        "thumbnail": "./data/kr/assets/heroes/Lavril/ico.png",
        "story_": "A very unconventional ghost. Those who see her may think of her as a ghost of an ordinary girl, but she's not a single spectral entity. Rather, she's an amalgamation of countless souls. Filled with tremendous spectral energy, she is powerful enough to make souls tremble and cast curses at her will....That is, if she was an ordinary ghost. Although she's a ghost born from an amalgamation of young souls that died in the Demon War 100 years ago, the souls of children are too pure and innocent to bear any grudge. Lavril, having been born from them, came into being with a pure and kind mind. Nonetheless, she's still a ghost. Her nature won't change. Even though she's currently a kind and poor girl, a child is like a piece of blank paper, in which a single drop of ink can easily change its color. Without any proper guidance, she can be a threat."
    },
    "skills": {
        "1": {
            "name": "G-go Away!",
            "cost": "2",
            "cooldown": "10",
            "description": "Deals ??? M.DMG to the target, increasing M.DMG it takes by 25% and reduces its All Crit Resistance by 300 for 10 sec. The hit target becomes affected by 'Lavril's Ectoplasm' for 5 sec, dealing ??? M.DMG every 0.5 sec. Dealing DMG with this Skill heals HP of all allies by 5% of DMG dealt. When the target is killed, resets this Skill's Cooldown and recovers self's Mana by 1 orb.",
            "thumbnail": "./data/kr/assets/heroes/Lavril/skills/1.png"
        },
        "2 (1)": {
            "name": "Bear Up...!",
            "cost": "4",
            "cooldown": "24",
            "description": "Heals the HP of an ally with the highest ATK by ???, heals HP by ??? every 1 sec for 15 sec. Increases ATK and Crit DMG of the ally by 20% and 50% + 15% of Lavril's Crit DMG respectively for 15 sec. After Skill use, [You Scare Me...!] can be used within 5 sec.",
            "thumbnail": "./data/kr/assets/heroes/Lavril/skills/2 (1).png"
        },
        "2 (2)": {
            "name": "You Scare Me...!",
            "cost": "1",
            "cooldown": "0",
            "description": "Deals ??? M.DMG to the enemy and reduces its ATK Spd by 250 for 15 sec while increasing M.DMG it takes by 25%.",
            "thumbnail": "./data/kr/assets/heroes/Lavril/skills/2 (2).png"
        },
        "3": {
            "name": "Leave Me Alone...!",
            "cost": "4",
            "cooldown": "25",
            "description": "Swirls a Spectral Tornado in a wide range to the front, dealing ??? M.DMG every 0.5 sec for 6 sec. Each hit reduces ATK of the target by 4.5% for 5 sec, and increases M.DMG it takes by 4.5%. This effect can be stacked up to max 10 times.",
            "thumbnail": "./data/kr/assets/heroes/Lavril/skills/3.png"
        },
        "4": {
            "name": "Together Forever...",
            "cost": null,
            "cooldown": null,
            "description": "At the beginning of the first battle, forms a 'Soul Link' with an ally with the highest ATK. This effect is irremovable. Lavril and the ally bound by 'Soul Link' has their ATK increased by ???, DEF Penetration by 300, All DEF by 15%, and DMG dealt to Non-Hero enemies by 8%, recovering 150 Mana every sec.",
            "thumbnail": "./data/kr/assets/heroes/Lavril/skills/4.png"
        }
    },
    "books": {
        "1": {
            "II": "DMG is increased by 10%.",
            "III": "DMG is increased by 15%.",
            "IV": "DMG is increased by 25%."
        },
        "2": {
            "II": "DMG and Heal Rate are increased by 10%.",
            "III": "DMG and Heal Rate are increased by 15%.",
            "IV": "DMG and Heal Rate are increased by 25%."
        },
        "3": {
            "II": "DMG is increased by 10%.",
            "III": "DMG is increased by 15%.",
            "IV": "DMG is increased by 25%."
        },
        "4": {
            "II": "ATK Boost is increased by 10%.",
            "III": "ATK Boost is increased by 15%.",
            "IV": "ATK Boost is increased by 25%."
        }
    },
    "perks": {
        "t3": {
            "1": {
                "light": {
                    "effect": "Changes All Crit Resistance Reduction to 500.",
                    "thumbnail": "./data/kr/assets/heroes/Lavril/perks/s1l.png"
                },
                "dark": {
                    "effect": "Increases Heal Rate by 100% when there is 1 enemy.",
                    "thumbnail": "./data/kr/assets/heroes/Lavril/perks/s1d.png"
                }
            },
            "2": {
                "light": {
                    "effect": "[Bear Up...!] - Keeps target's HP from going below 5% for the duration of skill.\n[You Scare Me...!] - Dispels positive effects from the target.",
                    "thumbnail": "./data/kr/assets/heroes/Lavril/perks/s2l.png"
                },
                "dark": {
                    "effect": "[Bear Up...!] - Increases the number of targets by 1.\n[You Scare Me...!] - Increases the target by 1.",
                    "thumbnail": "./data/kr/assets/heroes/Lavril/perks/s2d.png"
                }
            },
            "3": {
                "light": {
                    "effect": "Reduces Cooldown by 30%.",
                    "thumbnail": "./data/kr/assets/heroes/Lavril/perks/s3l.png"
                },
                "dark": {
                    "effect": "Reduces Mana Cost by 1.",
                    "thumbnail": "./data/kr/assets/heroes/Lavril/perks/s3d.png"
                }
            },
            "4": {
                "light": {
                    "effect": "Changes the DMG Boost effect against Non-Hero enemies of Lavril and the ally bound to 'Soul Link' to 12%.",
                    "thumbnail": "./data/kr/assets/heroes/Lavril/perks/s4l.png"
                },
                "dark": {
                    "effect": "Reduces DMG taken of self and the ally bound to Soul Link by 20%.",
                    "thumbnail": "./data/kr/assets/heroes/Lavril/perks/s4d.png"
                }
            }
        },
        "t5": {
            "light": {
                "effect": "ATK, DEF, HP+15% / Crit DMG +20%",
                "thumbnail": "./data/kr/assets/heroes/Lavril/perks/light.png"
            },
            "dark": {
                "effect": "Upon taking a hit, increases ATK of the ally bound by Soul Link by 3%. This effect can be stacked up to max 20 times.",
                "thumbnail": "./data/kr/assets/heroes/Lavril/perks/dark.png"
            }
        }
    },
    "uw": {
        "name": "Void Soul, Dunn Nemecia",
        "description": "Upon using a skill, gains [Void Soul] for (0) sec and dodges all attacks. This effect activates once every 10 sec. Increases Crit DMG of the ally under Soul Link by (1).",
        "value": {
            "0": {
                "0": "1",
                "1": "1.2",
                "2": "1.4",
                "3": "1.7",
                "4": "2.1",
                "5": "2.5"
            },
            "1": {
                "0": "30%",
                "1": "36%",
                "2": "42%",
                "3": "51%",
                "4": "63%",
                "5": "75%"
            }
        },
        "thumbnail": "./data/kr/assets/heroes/Lavril/uw.png",
        "story": "Another spectral entity that got separated from Lavril. Unlike kind Lavril, Dunn Nemecia is the amalgamation of the negative and aggressive souls that were inside her. Fortunately, this cute but scary ghost keeps its evil side hidden most of the time and uses its powers only when its host needs it, or when it senses a threat. But one must keep in mind that this strange ghost is not a nice, harmless being. It pulls mischievous tricks such as laying pointy toys around a sleeping person, throwing a freshly cooked dish to the ground, and tripping passerby. But it could do a lot more than just 'tricks' if it weren't in control of Lavril."
    },
    "uts": {
        "1": {
            "name": "Tarot Card of the Moon",
            "description": "[G-go Away!] Increases DMG by 50% and reduces hit enemies' Heal Rate by (0).",
            "value": {
                "0": {
                    "0": "20%",
                    "1": "24%",
                    "2": "29%",
                    "3": "35%",
                    "4": "42%",
                    "5": "50%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Lavril/ut/1.png",
            "story": "It was late at night when Lavril found a tent of a wandering fortune teller. There were strange creatures flying around her, and they were creating a strange atmosphere that made Lavril feel difficult to approach. The fortune teller sensed her presence and welcomed her. - Welcome to Stardust Fortune Teller's Tent. What do you wish to know? Looking at the fortune teller smile, Lavril timidly opened her mouth. - W-we... we want to make a friend. A friend who is different than us... A friend who breathes, who we can touch... Wh-where could we meet a friend like that...? The fortune teller handed her a card, smiling. On the card that the moon was engraved on, there was a powerful creature drawn on the surface. It was the creature that Lavril feared. Lavril tried to put the card down instantly out of visceral fear, But she then felt the creature accepting her touch, as if relieving her anxiety. Lavril was surprised for a moment, but soon felt at ease. Then, the fortune teller put her hands on Lavril's. - You don't have to look far. Aren't we already good friends? Finishing her sentence, the fortune teller started moving cards, one by one, still holding Lavril's hands. The cards were telling things to the fortune teller in silence, as if they wanted to make Lavril's desperate wish come true. Soon, the cards were all laid out in order and the fortune teller opened her mouth, smiling. - These boys and girls seem to like you very much. They are telling me that you're going to meet countless people that you will hold dear. Before long, you will meet the friends that you've been waiting for."
        },
        "2": {
            "name": "Fairy's Scent",
            "description": "[Bear Up...!] Increases Heal Rate by 50% and Crit DMG by (0). [You Scare Me!] Increases DMG by 50% and reduces target's M.DEF by (1).",
            "value": {
                "0": {
                    "0": "20%",
                    "1": "24%",
                    "2": "29%",
                    "3": "35%",
                    "4": "42%",
                    "5": "50%"
                },
                "1": {
                    "0": "10%",
                    "1": "12%",
                    "2": "14%",
                    "3": "17%",
                    "4": "21%",
                    "5": "25%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Lavril/ut/2.png",
            "story": "On one sunny day, Lavril was wandering around a village timidly, wanting to make some friends. She wanted to go inside the village and make some friends, but the recent memory of being driven away by the priests of Lua kept her from doing so. Just then, she heard a joyful singing near the flowerbeds just outside the village. Curious, she slowly moved toward where the voice was coming from. A girl was singing and playing the harp among the full-blown flowers, and the children, animals, even fairies were dancing to her song. Mesmerized by the scene, she was walking toward the flowerbeds before she knew it. The moment she set her foot in the flowerbeds, fairies and animals started to shriek and hide, and children burst into tears. They were very sensitive to energy, and they felt threatened by Lavril's presence. The girl, however, reacted in a completely different way. She calmed the creatures down, picked a few flowers around her, and handed them to Lavril. Holding the flowers, Lavril gave a blissful smile out of the feeling of acceptance. Then, animals, fairies, and children all started to greet her merrily, having realized Lavril would not harm them."
        },
        "3": {
            "name": "Blessed Protection",
            "description": "[Leave Me Alone...!] Increases the max stack of the effect by 2 and each hit increases M.DMG the target takes by (0).",
            "value": {
                "0": {
                    "0": "1%",
                    "1": "1.2%",
                    "2": "1.4%",
                    "3": "1.7%",
                    "4": "2.1%",
                    "5": "2.5%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Lavril/ut/3.png",
            "story": "When Lavril came into being, people thought of her as a scary ghost and spread rumors about her. The Church of Lua called in the high priests nearby to take care of her. The Saint of Blessings Lucias and the maverick Baudouin were among the ones that answered the call. Upon hearing about Lavril, the two hurriedly tracked her down and confronted her. As soon as they saw her, they realized that she was not an ordinary ghost, but an amalgamation of child ghosts. It didn't take long before they knew she wasn't a threat. However, the Church had spoken. Ghosts are to be exorcized, and as priests, they were supposed to cleanse her and guide her to where she belonged. But Lucias had a different idea. Lavril was a pure soul that did not deserve an exorcism, and he wanted to let her proceed to the next realm when the time comes, following the law of nature. Lucias took out his handkerchief, wiped the tears off Lavril's face, and showed her the path to the light with the teachings of Lua. This handkerchief reminds her of Lucias, the light that guides her when she is in trouble."
        },
        "4": {
            "name": "Tear of Soul",
            "description": "[Together Forever...] Increases ATK boost by 50%. Allies under Soul Link have their Heal Rate increased by (0).",
            "value": {
                "0": {
                    "0": "10%",
                    "1": "12%",
                    "2": "14%",
                    "3": "17%",
                    "4": "21%",
                    "5": "25%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Lavril/ut/4.png",
            "story": "Evil Spirits are embodiments of resentment, unable to control themselves due to their overwhelming instincts, driven by negative emotions such as rage and hatred. They are jealous of the living, and openly exhibit aggression to turn the living into new Evil Spirits like them. Lavril, however, is made of the juvenile innocence of children. It is an exception that is too pure to be called an Evil Spirit. A strange entity whose existence seems ironic. It is haunted by loneliness, even when it is full of countless souls. When she was first awakened in this land, she did not know who or what she was. Only pain and suffering dominated her body, and she lacked a clear purpose. The sorrow from the young souls who had met a painful demise began to form tears, and the exploding powers of the souls called out to other Evil Spirits. They say the vast sky was completely darkened when Lavril was born. Having heard her terrible cries, the first to arrive was Spiritual Guide Rephy. Learning about Lavril's plight from other souls, he was able to locate her with help from Oddy and Nyx. Rephy offered her many different gifts to stop her from crying, and this is what caught her eyes the most. This is a type of precious jewel left behind by vengeful Evil Spirits when they are banished. It is the last trace of a unshackled soul who has finally found freedom from evil. This jewel is believed to have soothed Lavril's deep sorrow."
        }
    },
    "sw": {
        "requirement": "Charges up over 22 sec.",
        "description": "Summons the soul of Void Soul, Dunn Nemecia, dealing ??? M.DMG to all enemies and inflicting them with 'Soul Mischief.' Enemies inflicted with 'Soul Mischief' take 8% increased M.DMG and have their Heal Rate reduced by 8% for 10 sec. Afterward, every time Lavril uses a Skill for 10 sec, she inflicts ??? M.DMG to all enemies and inflicts them with 'Soul Mischief'. The 'Soul Mischief' effect can be stacked up to max 3 times.",
        "cooldown": "20",
        "uses": "5",
        "thumbnail": "./data/kr/assets/heroes/Lavril/sw.png",
        "advancement": {
            "1": "Changes the max number of stacks of Soul Mischief to 4.",
            "2": "Increases the effect of Soul Mischief by 50%."
        },
        "story": "Lavril does not contemplate their existence.\n\nOne of the reasons why is probably because they only faintly associate themselves with the identity of darkness, but also because Lavril are just children who hate loneliness and think mostly about getting friends rather than contemplate on the meaning of existence. Compared to Lavril, Dunn Nemecia are much more aware of their situation, in which that they can be hunted down just because they were born of darkness, or devoured by stronger darkness.\nOne day, they met a dakrness of noble heritage who offered them to choose between two pathways.\nThe first was to recombine the two seperate groups that originally belonged to just one group called Lavril, and the other pathway was to acknowledge each other's existence, put trust into each other's potential, and work together to survive.\nThey had to make one irreversible choice to survive, and at the end, Lavril and Dunn Nemecia decided that they do not want either of them to disappear, and chose to acknowledge each other's existence.\n\n'We' may be different, but we will look after each other and stay together forever. The two darkness smiled and grabbed each other's hand."
    },
    "splashart": "./data/kr/assets/heroes/Lavril/sa.png",
    "costumes": "./data/kr/assets/heroes/Lavril/cos",
    "visual": null,
    "aliases": null
}