{
    "infos": {
        "title": "The Gatekeeper of Trust",
        "class": "Knight",
        "position": "Front-700",
        "attack range": "9300",
        "damage type": "Physical",
        "gender": "Male",
        "age": "24",
        "height": "187",
        "race": "Human",
        "constellation": "Guardian Mertis",
        "birth of month": "January 12th, Month of Protection",
        "like": "Clause, Demia, Jelly, Wood Carving",
        "dislike": "Mint, Ginseng",
        "story": "If one were to choose the most trustworthy among the Guardian Knights, Loman's name would be one of the first to come to mind. The royal family trusts him so much that they appointed Loman as the Gatekeeper of the Orvel Monarchy. He is usually a gentle and friendly man, but becomes uncompromising when anyone tries to approach his king without royal permission. No one who has seen his halberd, the one bestowed by Scarlet, split the air has ever returned alive. While off duty, however, he is a sensitive man who enjoys wood carving as a hobby.",
        "thumbnail": "./data/kr/assets/heroes/Loman/ico.png",
        "story_": "If one were to choose the most trustworthy among the Guardian Knights, Loman's name would be one of the first to come to mind. The royal family trusts him so much that they appointed Loman as the Gatekeeper of the Orvel Monarchy. He is usually a gentle and friendly man, but becomes uncompromising when anyone tries to approach his king without royal permission. No one who has seen his halberd, the one bestowed by Scarlet, split the air has ever returned alive. While off duty, however, he is a sensitive man who enjoys wood carving as a hobby."
    },
    "skills": {
        "1": {
            "name": "Cut Ground",
            "cost": "2",
            "cooldown": "8",
            "description": "Deals ??? P.DMG to frontal enemies within range and knocks them down for 4 sec, increasing P.Weakenss of the affected targets targets by 25% for 10 sec.",
            "thumbnail": "./data/kr/assets/heroes/Loman/skills/1.png"
        },
        "2": {
            "name": "Shrouding Creed",
            "cost": "3",
            "cooldown": "23",
            "description": "Removes negative effects from all allies. Casts a shield upon all allies that absorbs ??? DMG for 5 sec and reduces all DMG to allies by 20% for 10 sec. The shield grants immunity to CC while it lasts.",
            "thumbnail": "./data/kr/assets/heroes/Loman/skills/2.png"
        },
        "3": {
            "name": "Knight's Creed",
            "cost": "3",
            "cooldown": "24",
            "description": "Hits frontal enemies wiithin range 3 times. First 2 hits deal ??? P.DMG and stun enemies in wider range 2 times, dealing ??? P.DMG in total. The last hit stuns enemies for 5 sec and leaves [Mark of Creed] on the enemies. damaging them for 15 sec. Targets with [Mark of Creed] take additional ??? from allies excluding caster. Additionally DMG effect is activated only once every 0.5 sec.",
            "thumbnail": "./data/kr/assets/heroes/Loman/skills/3.png"
        },
        "4": {
            "name": "The Last Gatekeeper",
            "cost": null,
            "cooldown": null,
            "description": "Stacks [Endurance] every sec. [Endurance] cannot be dispelled, and when stacked 20 times, deals ??? P.DMG ignoring DEF on nearby enemies and reduces ATK of affected enemies by 20% for 10 sec. A successful block grants 1 additional [Endurance] stack. This effect is activated only once every 0.2 sec.",
            "thumbnail": "./data/kr/assets/heroes/Loman/skills/4.png"
        }
    },
    "books": {
        "1": {
            "II": "DMG is increased by 10%.",
            "III": "DMG is increased by 15%.",
            "IV": "Blocks all DMG while the skill in use."
        },
        "2": {
            "II": "Shield is increased by 10%.",
            "III": "Shield is increased by 15%.",
            "IV": "Shield is increased by 25%."
        },
        "3": {
            "II": "DMG is increased by 10%.",
            "III": "DMG is increased by 15%.",
            "IV": "DMG is increased by 25%."
        },
        "4": {
            "II": "DMG is increased by 10%.",
            "III": "DMG is increased by 15%.",
            "IV": "DMG is increased by 25%."
        }
    },
    "perks": {
        "t3": {
            "1": {
                "light": {
                    "effect": "Cooldown is reduced by 3 sec.",
                    "thumbnail": "./data/kr/assets/heroes/Loman/perks/s1l.png"
                },
                "dark": {
                    "effect": "Increases P.Weakness of the affected target by 25% for 10 seconds.",
                    "thumbnail": "./data/kr/assets/heroes/Loman/perks/s1d.png"
                }
            },
            "2": {
                "light": {
                    "effect": "Reduces Cooldown by 5 seconds.",
                    "thumbnail": "./data/kr/assets/heroes/Loman/perks/s2l.png"
                },
                "dark": {
                    "effect": "The shield lasts 5 seconds longer.",
                    "thumbnail": "./data/kr/assets/heroes/Loman/perks/s2d.png"
                }
            },
            "3": {
                "light": {
                    "effect": "When there is 1 enemy, DMG is boosted by 100%.",
                    "thumbnail": "./data/kr/assets/heroes/Loman/perks/s3l.png"
                },
                "dark": {
                    "effect": "While in use, gains immunity to CC.",
                    "thumbnail": "./data/kr/assets/heroes/Loman/perks/s3d.png"
                }
            },
            "4": {
                "light": {
                    "effect": "Increases the number of [Endurance] stacked every second by 1.",
                    "thumbnail": "./data/kr/assets/heroes/Loman/perks/s4l.png"
                },
                "dark": {
                    "effect": "Decreases ATK Spd of the affected enemy by 200 for 10 sec.",
                    "thumbnail": "./data/kr/assets/heroes/Loman/perks/s4d.png"
                }
            }
        },
        "t5": {
            "light": {
                "effect": "ATK, DEF, HP+15% / M. Block +200",
                "thumbnail": "./data/kr/assets/heroes/Loman/perks/light.png"
            },
            "dark": {
                "effect": "Upon successfully blocking M.DMG, all allies have their M.Block increased by 200 and M.DEF by 10% of Loman's M.DEF for 5 sec. This effect is activated only once every 5 seconds.",
                "thumbnail": "./data/kr/assets/heroes/Loman/perks/dark.png"
            }
        }
    },
    "uw": {
        "name": "Wave of Protection, Gaiamenes",
        "description": "Pride of Orvelia' is stacked on every use of skills. 'Pride of Orvelia' cannot be dispelled, and when stacked 3 times, 'Blessing of Orvelia' is activated, dealing (0) of ATK as P.DMG to enemies within a wide range and increasing P.Weakness of the targets by (1) for 20 seconds. 'Blessing of Orvelia' also increases M.DEF by (2) for 10 seconds.",
        "value": {
            "0": {
                "0": "200%",
                "1": "240%",
                "2": "290%",
                "3": "350%",
                "4": "420%",
                "5": "500%"
            },
            "1": {
                "0": "25%",
                "1": "30%",
                "2": "36%",
                "3": "43%",
                "4": "51%",
                "5": "60%"
            },
            "2": {
                "0": "10%",
                "1": "12%",
                "2": "14%",
                "3": "17%",
                "4": "21%",
                "5": "25%"
            }
        },
        "thumbnail": "./data/kr/assets/heroes/Loman/uw.png",
        "story": "The halberd held by an ancient guardian statue defending the gate of the labyrinth that was recently discovered at the Royal Underground. The old, eroded statue was holding the halberd firmly in its hands, as if showing its determination to protect the labyrinth against intruders. Loman, who was in charge of the labyrinth excavation, felt something indescribably sublime from the statue and showed due courtesy in front of it. At that moment, the statue dropped its halberd to the ground and began to crumble away. The halberd itself seemed unaffected by time and was imbued with a mysterious energy. 'That statue suddenly crumbled and dropped the halberd...' Scarlet said, glancing over the report. 'Yes, ma'am.' Scarlet then gazed at Loman. 'The unyielding sincerity of protecting a place until his very body collapses... I know a man like that.' 'Pardon, ma'am?' He looked at Scarlet with a puzzled face as she handed over the halberd, smiling."
    },
    "uts": {
        "1": {
            "name": "Basic Combat Techniques of Orvelian Knights",
            "description": "[Cut Ground] For 10 sec, reduces the target's P.Block by 500 and CC Resist by (0).",
            "value": {
                "0": {
                    "0": "100",
                    "1": "120",
                    "2": "140",
                    "3": "170",
                    "4": "210",
                    "5": "250"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Loman/ut/1.png",
            "story": "A basic martial arts that covers the basics that all Orvel knights learn. Among their many skills, Cut Ground provides a solid foundation for a knight's fighting style. It is one of the first skills knights learn, but its complicated mechanism creates a big difference in power between the novice and the proficient. Loman has read it more than a thousand times since he became a knight, and he always goes back to it whenever he feels the need for further improvement."
        },
        "2": {
            "name": "Wooden Doll Miniature",
            "description": "[Shrouding Creed] Reduces Mana Cost by 1 and recovers target's Mana by (0).",
            "value": {
                "0": {
                    "0": "400",
                    "1": "480",
                    "2": "580",
                    "3": "700",
                    "4": "840",
                    "5": "1000"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Loman/ut/2.png",
            "story": "Loman used to carve small sculptures as big as his hand while sorting out his thoughts when things went wrong. As he smoothed out their edges, he'd feel at peace, recalling how he was when he was just learning the basics. It was just a pastime at first, but soon it became his hobby, a passion that filled his room with hundreds of sculptures. And one day, Loman started to make wooden dolls to give to his friends and his men. Back then, sorcerous dolls known to protect hearts from evil were popular in Orvelia. Loman asked an old shaman who practiced ancient folk remedies to enchant his wooden dolls with a spell of protection, and he gave them to his colleagues."
        },
        "3": {
            "name": "Sea of Invocation",
            "description": "[Knight's Creed] Reduces Cooldown by 30%, and increases P.Weakness of the target by (0) for 10 sec.",
            "value": {
                "0": {
                    "0": "10%",
                    "1": "12%",
                    "2": "14%",
                    "3": "17%",
                    "4": "21%",
                    "5": "25%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Loman/ut/3.png",
            "story": "An heirloom of Loman's family, this special pendant is bestowed by the first King of Orvelia to Loman's family in honor of their service and loyalty to protect the Orvel Monarchy. Its true origin is unknown, but it is believed to be an accessory that has the spirit of the Guardian of Orbis Continent from an ancient civilization. The owners of this item have said the same thing. When they resolve to stake their lives to defend what is important to them, they invoke a mighty power like the waves of the sea. People now believe this blue gem invokes spirits, and it started to be called the Sea of Invocation. Loman received it as an heirloom from his father when he entered the castle, and he always keeps it with him."
        },
        "4": {
            "name": "Father's Shield",
            "description": "[The Last Gatekeeper] Increases own M.Block by (0). Upon block, the number of Endurance Stacks increases by 1.",
            "value": {
                "0": {
                    "0": "200",
                    "1": "240",
                    "2": "290",
                    "3": "350",
                    "4": "420",
                    "5": "500"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Loman/ut/4.png",
            "story": "A shield that Loman used in the past. It is his treasure that his father, who was a gatekeeper of the royal family, gave him. Although he has not used it since he started using his halberd, he has kept the words of his father in his heart: be the gate that protects Orvelia. Whatever may come, Loman will never allow the edge of an enemy sword to cross the gate of Orvelia while he breathes."
        }
    },
    "sw": {
        "requirement": "Charges up over 22 sec.",
        "description": "Summons the soul of Wave of Protection, Gaiamenes, dealing ??? P.DMG to frontal enemies and inflicting Stun for 3 sec. Afterward, for 10 sec, increases all allies' ATK by 30% + equal to 5% of Loman's ATK, and increases M.DEF by 30% while recovering 1000 Mana of all allies every 3 sec.",
        "cooldown": "22",
        "uses": "7",
        "thumbnail": "./data/kr/assets/heroes/Loman/sw.png",
        "advancement": {
            "1": "Heals all allies equal to 12% of Max HP and dispels negative effects every 3 sec.",
            "2": "Reduces Skill Activation requirements by 6 sec. Upon hit, increases P.DMG the hit target takes by 35% for 10 sec."
        },
        "story": "One day, when Loman was guarding the Ancient Royal Vault, a gigantic and ruthless monster attempted to break out. Loman faced the creature alone, and upon hearing the outbreak, the royal palace immediately sent soldiers to the vault. When the soldiers arrived, they saw Loman who was struggling alone to repel the monster. The soldiers charged toward the monster to aid Loman, but when the soldiers surrounded the monster, it went on a full rampage and lashed out brutal attacks against the soldiers. Seeing his colleagues getting hurt, Loman blamed himself for his incompetence to stop the monster. He felt a strong urge to save them. That moment, his honest and sincere nature pure as water combined with the great trust of his colleagues toward Loman, Gaiamenes released its true power to help Loman fulfill his will."
    },
    "splashart": "./data/kr/assets/heroes/Loman/sa.png",
    "costumes": "./data/kr/assets/heroes/Loman/cos",
    "visual": null,
    "aliases": null
}