{
    "infos": {
        "title": "Incarnation of Destruction",
        "class": "Wizard",
        "position": "Front",
        "attack range": "10000",
        "damage type": "Magical",
        "gender": "Male",
        "age": "???",
        "height": "196",
        "race": "Demon",
        "constellation": "Gisla the Sharpshooter",
        "birth of month": "November 16th, Month of Fortune",
        "like": "An evenly-matched opponent, a battlefield with no rules, creme brulee",
        "dislike": "Beings that cannot even identify their own power, getting involved in an annoying situation, getting interrupted during a fight",
        "story": "One of the Five Primal Demons whom Lea bestowed her power upon. Bestowed with the pwoer of 'Destruction,' Lucikiel is gifted with powerful strength, even among the Primal Demons. The 'Power of Destruction,' however, gives much more than just supremacy in battle strength. Its reach is not limited to only object that can be seen or touched. It can even affect the worlds themselves, and one of its usages is temporarily 'destroying' the rift between the Pandemonium and the Material World to travel between the worlds. Using this, Lucikiel has been traveling between the two worlds even before the Demons invaded the Material World, observing the world that he will destroy one day. During all these times, nothing really piqued Lucikiel's interest in the Material World - until certain individuals attracted his attention. How these individuals will affect Lucikiel's course of action is yet to unfold.",
        "thumbnail": "./data/kr/assets/heroes/Lucikiel/ico.png",
        "story_": "One of the Five Primal Demons whom Lea bestowed her power upon. Bestowed with the power of 'Destruction,' Lucikiel is gifted with powerful strength, even among the Primal Demons. The 'Power of Destruction,' however, gives much more than just supremacy in battle strength. Its reach is not limited to only object that can be seen or touched. It can even affect the worlds themselves, and one of its usages is temporarily 'destroying' the rift between the Pandemonium and the Material World to travel between the worlds. Using this, Lucikiel has been traveling between the two worlds even before the Demons invaded the Material World, observing the world that he will destroy one day. During all these times, nothing really piqued Lucikiel's interest in the Material World - until certain individuals attracted his attention. How these individuals will affect Lucikiel's course of action is yet to unfold."
    },
    "skills": {
        "1": {
            "name": "Death Storm",
            "cost": "2",
            "cooldown": "13",
            "description": "Attacks the target and nearby enemies 3 times, dealing a total of ??? M.DMG and leaving a [Shadow of Death]. [Shadow of Death] deals ??? M.DMG and reduces the target's Heal Rate by 30% over 10 sec.",
            "thumbnail": "./data/kr/assets/heroes/Lucikiel/skills/1.png"
        },
        "2 (1)": {
            "name": "Annihilation Wave",
            "cost": "3",
            "cooldown": "13",
            "description": "Attacks frontal enemies within range 2 times. The first attack deals ??? M.DMG and inflicts Stun for 3 sec. The second attack deals ??? M.DMG and draws in hit targets in front of self. After use, the Skill changes to [Annihilation Surge].",
            "thumbnail": "./data/kr/assets/heroes/Lucikiel/skills/2 (1).png"
        },
        "2 (2)": {
            "name": "Annihilation Surge",
            "cost": "3",
            "cooldown": "13",
            "description": "Attacks frontal enemies within a wide range 2 times. The first attack deals ??? M.DMG and inflicts stun for 5 sec. The second attack deals ??? M.DMG and draws in hit targets in front of self. After use, the Skill changes to [Annihilation Wave].",
            "thumbnail": "./data/kr/assets/heroes/Lucikiel/skills/2 (2).png"
        },
        "3": {
            "name": "Doomsday",
            "cost": "4",
            "cooldown": "23",
            "description": "Attacks nearby enemies 9 times, dealing a total of ??? M.DMG, and draws them in front of self. The last hit deals ??? M.DMG, knocks down hit targets for 5 sec, and leaves [Pain of Doom] that lasts for 10 sec. Each time Lucikiel attacks targets inflicted with [Pain of Doom] with a normal or Skill attack, he deals ??? additional M.DMG.",
            "thumbnail": "./data/kr/assets/heroes/Lucikiel/skills/3.png"
        },
        "4": {
            "name": "Armor of the Demon God",
            "cost": null,
            "cooldown": null,
            "description": "Reduces All DMG taken by 25% and the duration of CC by 50%. Upon every Skill use, creates [Authority of the Demon God] that absorbs ??? DMG for 6 sec. Gains immunity to CC for the duration of [Authority of the Demon God].",
            "thumbnail": "./data/kr/assets/heroes/Lucikiel/skills/4.png"
        }
    },
    "books": {
        "1": {
            "II": "DMG is increased by 10%.",
            "III": "DMG is increased by 15%.",
            "IV": "DMG is increased by 25%."
        },
        "2": {
            "II": "DMG is increased by 10%.",
            "III": "DMG is increased by 15%.",
            "IV": "DMG is increased by 25%."
        },
        "3": {
            "II": "DMG is increased by 10%.",
            "III": "DMG is increased by 15%.",
            "IV": "DMG is increased by 25%."
        },
        "4": {
            "II": "Shield is increased by 10%.",
            "III": "Shield is increased by 15%.",
            "IV": "Shield is increased by 25%."
        }
    },
    "perks": {
        "t3": {
            "1": {
                "light": {
                    "effect": "[Shadow of Death] Becomes irremovable.",
                    "thumbnail": "./data/kr/assets/heroes/Lucikiel/perks/s1l.png"
                },
                "dark": {
                    "effect": "[Shadow of Death] additionally increases M.DMG taken by 25%.",
                    "thumbnail": "./data/kr/assets/heroes/Lucikiel/perks/s1d.png"
                }
            },
            "2": {
                "light": {
                    "effect": "Reduces Mana Cost by 1.",
                    "thumbnail": "./data/kr/assets/heroes/Lucikiel/perks/s2l.png"
                },
                "dark": {
                    "effect": "At the beginning of the first battle, changes the skill to [Annihilation Surge].",
                    "thumbnail": "./data/kr/assets/heroes/Lucikiel/perks/s2d.png"
                }
            },
            "3": {
                "light": {
                    "effect": "Reduces Cooldown by 7 sec.",
                    "thumbnail": "./data/kr/assets/heroes/Lucikiel/perks/s3l.png"
                },
                "dark": {
                    "effect": "Each hit reduces the hit target's Mana by 200.",
                    "thumbnail": "./data/kr/assets/heroes/Lucikiel/perks/s3d.png"
                }
            },
            "4": {
                "light": {
                    "effect": "At the beginning of each battle, creates [Authority of the Demon God].",
                    "thumbnail": "./data/kr/assets/heroes/Lucikiel/perks/s4l.png"
                },
                "dark": {
                    "effect": "Reduces All DMG taken by an additional 15%.",
                    "thumbnail": "./data/kr/assets/heroes/Lucikiel/perks/s4d.png"
                }
            }
        },
        "t5": {
            "light": {
                "effect": "ATK, DEF, HP +15% / Crit Chance +100",
                "thumbnail": "./data/kr/assets/heroes/Lucikiel/perks/light.png"
            },
            "dark": {
                "effect": "Increases DMG dealt to enemies by 5% every 6 sec. This effect can be stacked up to max 10 times and is irremovable.",
                "thumbnail": "./data/kr/assets/heroes/Lucikiel/perks/dark.png"
            }
        }
    },
    "uw": {
        "name": "Form of Ultimate Destruction, Barbatos Gigante",
        "description": "Gains a stack of [Incarnation of Doom] upon attacking an enemy 10 times. Each stack of [Incarnation of Doom] increases ATK by (0) and ATK Spd by (1). This effect can be stacked up to max 10 times and is irremovable. At 10 stacks of [Incarnation of Doom], Lucikiel's normal and Skill attacks deal additional M.DMG that ignores DEF equal to (2) of his ATK to a target.",
        "value": {
            "0": {
                "0": "4%",
                "1": "4.8%",
                "2": "5.8%",
                "3": "7%",
                "4": "8.4%",
                "5": "10%"
            },
            "1": {
                "0": "20",
                "1": "24",
                "2": "29",
                "3": "35",
                "4": "42",
                "5": "50"
            },
            "2": {
                "0": "30%",
                "1": "36%",
                "2": "43%",
                "3": "52%",
                "4": "63%",
                "5": "75%"
            }
        },
        "thumbnail": "./data/kr/assets/heroes/Lucikiel/uw.png",
        "story": "As a member of the Five Primal Demons, Lucikiel is the agent of destruction that will destroy the world if it is the will of the Goddess Lea. Lucikiel mostly harnesses the power he received from the Goddess in battle, earning him the title of the strongest Demon in existence. As of right now, Lucikiel has perfect control over his immense desire to destroy. He can use this desire at will, whenever he wants. Unlike his son, whose imperfect Barbatos manifests more as 'bind,' Lucikiel's barbatos is manifestation of his Power of Destruction, free of restriction, which functions as a powerful weapon."
    },
    "uts": {
        "1": {
            "name": "Emblem of Destruction",
            "description": "[Death Storm] Reduces Cooldown by 3 sec and [Shadow of Death] additionally increases M.DMG take by (0).",
            "value": {
                "0": {
                    "0": "12%",
                    "1": "12%",
                    "2": "17%",
                    "3": "21%",
                    "4": "25%",
                    "5": "30%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Lucikiel/ut/1.png",
            "story": "Pandemonium is the true arena of survival of the fittest, where the stron prey upon the weak, and the rule of power answers all. That is why all Demons crave 'strength' - the absolute power. Then what must Demons do to prove that they are strong? The most obvious answer is to challenge the stronger Demon and win. For eons, Demons who were confident in their strength challenged Lucikiel, but none could defeat him. Lucikiel grew tired of such Demons that he started carrying this emblem. This Emblem symbolizes Lucikiel's mightiness as one fo the Primal Demons and is used as a motif in Lucikiel's attire. Subordinate Demons tremble in fear and awe whenever they catch a glimpse of this emblem that represents the Power of 'Destruction.'"
        },
        "2": {
            "name": "Dark Blue Leather Strap",
            "description": "[Annihilation Wave] Dispels positive effects from hit targets and increases CC ACC by (0) for the duration of Skill.\n[Annihilation Surge] Dispels positive effects from hit targets and increases CC ACC by (1) for the duration of Skill.",
            "value": {
                "0": {
                    "0": "300",
                    "1": "360",
                    "2": "430",
                    "3": "520",
                    "4": "630",
                    "5": "750"
                },
                "1": {
                    "0": "400",
                    "1": "480",
                    "2": "580",
                    "3": "700",
                    "4": "840",
                    "5": "1000"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Lucikiel/ut/2.png",
            "story": "When the Dimensional Gate opened and the Republic of Gray fell, many Heroes gave their all to face Lucikiel, only to fall one by one. The Republic cumbled in a heartbeat, as Lucikiel expected. History seemed to repeat itself,, the only difference being the place of events. Lucikiel suppressed the boredom piling within and marched onward to the final battle to end it all. It was then when a single human knight inflicted a lasting wound on Lucikiel. The scar that was inflicted on his arm during that battle is something Lucikiel can never forget. This band, made of the black leather of a Demon Beast, was used during the time to stop the bleeding. It is stained in the blue blood spilled by Lucikiel."
        },
        "3": {
            "name": "Horns of a Random Demon",
            "description": "[Doomsday] Changes DMG dealt with [Pain of Doom] to DMG that ignores DEF and increases DMG dealt with [Pain of Doom] by (0).",
            "value": {
                "0": {
                    "0": "20%",
                    "1": "24%",
                    "2": "29%",
                    "3": "35%",
                    "4": "42%",
                    "5": "50%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Lucikiel/ut/3.png",
            "story": "Long, long ago, there was a Demon who desired Lucikiel's Power of 'Destruction.' Altough there were many with the same desire, this Demon was the first to actually try. The Demon was of high rank and believed its power was equal or stronger than Lucikiel. Some thought that they were euqally-matched as the Demon was regarded to be quite powerful. However, that expectation was shattered when Lucikiel easily thwarted the Demon's ambitious challenge. To make sure that such a thing would never happen again, Lucikiel made an example of the Demon by its horns and keeping them."
        },
        "4": {
            "name": "Blue Blood Earrings",
            "description": "[Armor of the Demon God] [Authority of the Demon God] becomes irremovable and shield increases by (0).",
            "value": {
                "0": {
                    "0": "20%",
                    "1": "24%",
                    "2": "29%",
                    "3": "35%",
                    "4": "42%",
                    "5": "50%"
                }
            },
            "thumbnail": "./data/kr/assets/heroes/Lucikiel/ut/4.png",
            "story": "A pair of earrings made of Lucikiel's crystallized blue blood. While forming a body to use in the Material World, Lucikiel's blood became the component that contained the most Demonic Energy. When condensed, it becomes a medium that carries a portion of Lucikiel's strength, but Lucikiel dislikes making it, let alone handing it to someone else since it can cause annoying situations. But some time ago, Lucikiel gifted numerous bloodstones to a lady with whom he was very close. As she made a necklace for herself with the bloodstones, she also made a pair of earrings and gave them to Lucikiel as a token of gratitude."
        }
    },
    "sw": {
        "requirement": "Charges up upon using Skills 3 times.",
        "description": "Resonates with the soul of Form of Ultimate Destruction, Barbatos Gigante, creating [Authority of the Demon God] upon self, dealing M.DMG to enemies within range, and inflicting Stun for 4 sec. Afterward, the soul of Form of Ultimate Destruction, Barbatos Gigante remains for 10 sec. Lucikiel cannot use any Skills for the duration of the soul, but his ATK Spd increases by 400, All DMG taken reduces by 30%, DMG of normal attacks increases by 2 , normal attacks deal DMG that ignores DEF, dealing 50% DMG to the target's nearby enemies. If Lucikiel kills an enemy while his soul remains, he creates [Authority of the Demon God].",
        "cooldown": "16",
        "uses": "5",
        "thumbnail": "./data/kr/assets/heroes/Lucikiel/sw.png",
        "advancement": {
            "1": "Upon using the Soul Weapon Skill, Lucikiel dispels negative effects from self and dispels positive effects from targets hit by the first soul-resonating",
            "2": "Increases the duration of the soul by 5 sec and reduces Cooldown by 5 sec. Gains immunity to CC for the duration of the soul."
        },
        "story": "As a result of using the Power of Destruction in countless battles, the Power of Destruction started manifesting itself in a unique way. Through slightly, the power started reflecting the wish of its wielder. Eventually, not only did it have a material form, but it evolved into a transcendental form. Taking after the personality of its master, Lucikiel, the Power of Destruction of this weapon becomes stronger whenever it defeats an enemy."
    },
    "splashart": "./data/kr/assets/heroes/Lucikiel/sa.png",
    "costumes": "./data/kr/assets/heroes/Lucikiel/cos",
    "visual": null,
    "aliases": [
        "papakiel"
    ]
}